ici-test-automation-feature-environment-readiness/ic-integration-tests/src/test/resources/captia/dokumentScenario/ReadDocument_envelope.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:ns="http://skat.dk/begrebsmodel/2009/01/15/">
    <soapenv:Header/>
    <soapenv:Body>
        <ns:DokumentHent_I revision="gero et">
            <ns:Kontekst>
                <tsk:HovedOplysninger xmlns:tsk="http://skat.dk/begrebsmodel/xml/schemas/kontekst/2007/05/31/">
                    <tsk:TransaktionsID>49705142-cb3f-4428-b507-c0235fc744be_TEST</tsk:TransaktionsID>
                    <tsk:TransaktionsTid>2016-11-29T12:04:22Z</tsk:TransaktionsTid>
                </tsk:HovedOplysninger>
            </ns:Kontekst>
            <ns:Søgekriterier>
                <ns:DokumentNummer>${Properties#DokumentNummer}</ns:DokumentNummer>
                <ns:TilpasningAfResultat>
                    <ns:DokumentFilMarkering>true</ns:DokumentFilMarkering>
                    <ns:SagTilknytningListeMarkering>true</ns:SagTilknytningListeMarkering>
                    <ns:DokumentErindringListeMarkering>true</ns:DokumentErindringListeMarkering>
                    <ns:DokumentHenvisningListeMarkering>true</ns:DokumentHenvisningListeMarkering>
                    <ns:DokumentPartListeMarkering>true</ns:DokumentPartListeMarkering>
                    <ns:DokumentFriOplysningMarkering>true</ns:DokumentFriOplysningMarkering>
                    <ns:DokumentFriDatoMarkering>true</ns:DokumentFriDatoMarkering>
                </ns:TilpasningAfResultat>
            </ns:Søgekriterier>
        </ns:DokumentHent_I>
    </soapenv:Body>
</soapenv:Envelope>