ici-test-automation-feature-environment-readiness/ic-integration-tests/src/test/resources/captia/dokumentHent/ValidRequest_envelope.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://skat.dk/begrebsmodel/2009/01/15/">
    <soapenv:Header/>
    <soapenv:Body>
        <ns:DokumentHent_I revision="gero et">
            <ns:Kontekst>
            </ns:Kontekst>
            <ns:Søgekriterier>
                <ns:DokumentNummer>100</ns:DokumentNummer>
                <ns:TilpasningAfResultat>
                    <ns:DokumentFilMarkering>true</ns:DokumentFilMarkering>
                    <ns:SagTilknytningListeMarkering>true</ns:SagTilknytningListeMarkering>
                    <ns:DokumentErindringListeMarkering>true</ns:DokumentErindringListeMarkering>
                    <ns:DokumentHenvisningListeMarkering>true</ns:DokumentHenvisningListeMarkering>
                    <ns:DokumentPartListeMarkering>true</ns:DokumentPartListeMarkering>
                    <ns:DokumentFriOplysningMarkering>false</ns:DokumentFriOplysningMarkering>
                    <ns:DokumentFriDatoMarkering>false</ns:DokumentFriDatoMarkering>
                </ns:TilpasningAfResultat>
            </ns:Søgekriterier>
        </ns:DokumentHent_I>
    </soapenv:Body>
</soapenv:Envelope>